blog/hacking-ida-pro-installer-of-windows-version.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>破解IDA Pro 7.2版本（windows version）</title>
<!-- 2019-06-29 Sat 16:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">破解IDA Pro 7.2版本（windows version）</h1>
<p>
前几天听(scz)说有人搞定了IDA 7.2及以前版本的安装密码生成算法<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>，有人也直接在reddit上贴出来跑出来的7.2安装密码 <b>7JpT48a7Y2fv</b> ，经测试是可以安装的。感兴趣也可以通过公布的算法自己跑下。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 原始软件md5值</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
&gt; md5sum IDA-Pro-v7.2-nopasswd.exe 
f1982a5c602ee0930160b6b52e76c031
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 下载地址及百度云资源不限速下载工具</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>下载地址1: <a href="https://www.ninefile.com/op5ovxo5d9wn.html">https://www.ninefile.com/op5ovxo5d9wn.html</a>
</li>
<li>下载地址2: <a href="https://pan.baidu.com/s/1F758v3fQ9egeyCCPDiGLNA">https://pan.baidu.com/s/1F758v3fQ9egeyCCPDiGLNA</a>  提取码: <b>u05x</b>
</li>
<li>下载工具: <a href="https://www.baiduwp.com/">https://www.baiduwp.com/</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="https://devco.re/blog/2019/06/21/operation-crack-hacking-IDA-Pro-installer-PRNG-from-an-unusual-way-en/">https://devco.re/blog/2019/06/21/operation-crack-hacking-IDA-Pro-installer-PRNG-from-an-unusual-way-en/</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>